import { createAction, createReducer } from "@reduxjs/toolkit";

const initialState = {
    pageIsNow: 1,
    productThatNow: {
        name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
        mark: '20',
        GOST: 'ГОСТ25660-23',
        width: '223',
        thickness: '345',
        length: '430',
        price: 30000,
        description: [
            'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
            'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
            'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
        ],
        path: [
            {
                path: '',
                text: '...'
            },
            {
                path: '/sheel_metal',
                text: 'Листовий прокат'
            },
            {
                path: '/stainless_sheel_metal',
                text: 'Лист нержавіючий'
            },
            {
                path: '',
                text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
            }
        ]
    },
    products: [
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        },
        {
            name: 'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637',
            mark: '20',
            GOST: 'ГОСТ25660-23',
            width: '223',
            thickness: '345',
            length: '430',
            price: 30000,
            description: [
                'Купити товар «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» в Єкатеринбурзі за вигідною ціною за метр, тонну або іншу одиницю виміру. Онлайн-калькулятор розрахує вартість, розміри та масу виробу (кг, т).',
                'Ознайомтеся з описом та технічними характеристиками товару «Аркуш гарячекатаний 8 1.5м 6м ст3пс5/сп5 14637» на офіційному сайті «Сталепромислової компанії» або дзвоніть за номером в Киеві +8 800 555 3535 та отримайте консультацію наших спеціалістів.',
                'У продажу широкий асортимент товарів категорії «Лист листовий»: Лист холоднокатаний, Лист низьколегований, Лист гарячекатаний та ін. Ми відповідаємо за якість та пропонуємо професійний сервіс: послуги різання та металообробки, навантаження та доставку металопрокату.'
            ],
            path: [
                {
                    path: '',
                    text: '...'
                },
                {
                    path: '/sheel_metal',
                    text: 'Листовий прокат'
                },
                {
                    path: '/stainless_sheel_metal',
                    text: 'Лист нержавіючий'
                },
                {
                    path: '',
                    text:  'Лист Г/К 10 1.5м 6м ст3пс5/сп5 14637'
                }
            ]
        }
    ]
}

export const changePage = createAction('products/changePage', (pageNumber) => ({
    payload: pageNumber
}));

const productsReducer = createReducer(initialState, (builder) => {
    builder.addCase(changePage, (state, action) => {
        
    });
});

export default productsReducer;